In [6]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import matplotlib 
import seaborn as sns
%matplotlib inline

In [7]:
matplotlib.rcParams['axes.unicode_minus'] = False 
matplotlib.rcParams['font.family'] = "AppleGothic"

In [8]:
kmovies = pd.DataFrame({'MovieID':['1193','1194','1195'],
                        'Title':['디바','무림의 고수','정직한 후보'],
                        'Genres':['드라마','액션','코미디']})
kusers= pd.DataFrame({'UserID':[1,2,3,4,5],
                      'Gender':['F','M','M','F','M'],
                      'Age':[13,56,25,33,43]})

kratings= pd.DataFrame({'UserID':[1,1,1,2,2,2,3,3,3,4,4,4],
                        'MovieID':['1193','1194','1195','1193','1194','1195','1193','1194','1195','1193','1194','1195'],
                        'Rating':[2,5,None,3,1,5,None,2,5,5,None,3]})

In [9]:
print(kratings)
print(kusers)
print(kmovies)

    UserID MovieID  Rating
0        1    1193     2.0
1        1    1194     5.0
2        1    1195     NaN
3        2    1193     3.0
4        2    1194     1.0
5        2    1195     5.0
6        3    1193     NaN
7        3    1194     2.0
8        3    1195     5.0
9        4    1193     5.0
10       4    1194     NaN
11       4    1195     3.0
   UserID Gender  Age
0       1      F   13
1       2      M   56
2       3      M   25
3       4      F   33
4       5      M   43
  MovieID   Title Genres
0    1193      디바    드라마
1    1194  무림의 고수     액션
2    1195  정직한 후보    코미디

### 데이터셋 merge

kmovies와 kusers 사이에 공통변수 없음 <br>
kusers와 kratings에는 공통변수 존재 (UserID)<br>
kmovies와 kratings에 공통변수 존재 (MovieID)<br>
kratings에 kusers와 kmovies를 merge

In [10]:
kratings.merge(kusers)

    UserID MovieID  Rating Gender  Age
0        1    1193     2.0      F   13
1        1    1194     5.0      F   13
2        1    1195     NaN      F   13
3        2    1193     3.0      M   56
4        2    1194     1.0      M   56
5        2    1195     5.0      M   56
6        3    1193     NaN      M   25
7        3    1194     2.0      M   25
8        3    1195     5.0      M   25
9        4    1193     5.0      F   33
10       4    1194     NaN      F   33
11       4    1195     3.0      F   33

In [11]:
kratings

    UserID MovieID  Rating
0        1    1193     2.0
1        1    1194     5.0
2        1    1195     NaN
3        2    1193     3.0
4        2    1194     1.0
5        2    1195     5.0
6        3    1193     NaN
7        3    1194     2.0
8        3    1195     5.0
9        4    1193     5.0
10       4    1194     NaN
11       4    1195     3.0

In [12]:
kusers

   UserID Gender  Age
0       1      F   13
1       2      M   56
2       3      M   25
3       4      F   33
4       5      M   43

In [13]:
kdata = kratings.merge(kusers).merge(kmovies) # 영화에 대한 정보까지 병합 완료

In [14]:
kdata

    UserID MovieID  Rating Gender  Age   Title Genres
0        1    1193     2.0      F   13      디바    드라마
1        2    1193     3.0      M   56      디바    드라마
2        3    1193     NaN      M   25      디바    드라마
3        4    1193     5.0      F   33      디바    드라마
4        1    1194     5.0      F   13  무림의 고수     액션
5        2    1194     1.0      M   56  무림의 고수     액션
6        3    1194     2.0      M   25  무림의 고수     액션
7        4    1194     NaN      F   33  무림의 고수     액션
8        1    1195     NaN      F   13  정직한 후보    코미디
9        2    1195     5.0      M   56  정직한 후보    코미디
10       3    1195     5.0      M   25  정직한 후보    코미디
11       4    1195     3.0      F   33  정직한 후보    코미디

In [15]:
# 원하는 데이터만 뽑아오기
krecom_data = kdata[['UserID','MovieID','Rating']].copy()
krecom_data

    UserID MovieID  Rating
0        1    1193     2.0
1        2    1193     3.0
2        3    1193     NaN
3        4    1193     5.0
4        1    1194     5.0
5        2    1194     1.0
6        3    1194     2.0
7        4    1194     NaN
8        1    1195     NaN
9        2    1195     5.0
10       3    1195     5.0
11       4    1195     3.0

## pivot테이블 만들기
* data.pivot(index = '',columns = '', values = '')

In [16]:
krecom_pivot = krecom_data.pivot(index = 'UserID',columns = 'MovieID',values = 'Rating')
krecom_pivot

MovieID  1193  1194  1195
UserID
1         2.0   5.0   NaN
2         3.0   1.0   5.0
3         NaN   2.0   5.0
4         5.0   NaN   3.0

In [17]:
krecom_pivot

MovieID  1193  1194  1195
UserID
1         2.0   5.0   NaN
2         3.0   1.0   5.0
3         NaN   2.0   5.0
4         5.0   NaN   3.0

### nan값 처리

methods에서 inplace사용

In [18]:
krecom_pivot.fillna(0, inplace = True) #inplace = True 사용하면 재할당하지 않아도 실제 데이터에 변경사항이 적용된다

In [19]:
krecom_pivot

MovieID  1193  1194  1195
UserID
1         2.0   5.0   0.0
2         3.0   1.0   5.0
3         0.0   2.0   5.0
4         5.0   0.0   3.0

In [20]:
krecom_pivot_table = krecom_data.pivot_table(index = 'UserID',columns = 'MovieID',values = 'Rating',aggfunc = 'mean', fill_value = 0)

In [21]:
krecom_pivot_table
# aggfunc

MovieID  1193  1194  1195
UserID
1           2     5     0
2           3     1     5
3           0     2     5
4           5     0     3

In [22]:
krecom_pivot_table2 = krecom_data.pivot_table(index = 'UserID',columns = 'MovieID',values = 'Rating',aggfunc = 'min', fill_value = 0)

In [23]:
krecom_pivot_table2

MovieID  1193  1194  1195
UserID
1           2     5     0
2           3     1     5
3           0     2     5
4           5     0     3

In [24]:
df = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo",
...                          "bar", "bar", "bar", "bar"],
...                    "B": ["one", "one", "one", "two", "two",
...                          "one", "one", "two", "two"],
...                    "C": ["small", "large", "large", "small",
...                          "small", "large", "small", "small",
...                          "large"],
...                    "D": [1, 2, 2, 3, 3, 4, 5, 6, 7],
...                    "E": [2, 4, 5, 5, 6, 6, 8, 9, 9]})
table = pd.pivot_table(df, values=['D', 'E'], index=['A', 'C'], aggfunc={'D': np.mean,'E': [min, max, np.mean]}) # 'A','C'를 인덱스로 사용...                    
...

In [25]:
table

                  D    E
               mean  max      mean  min
A   C
bar large  5.500000  9.0  7.500000  6.0
    small  5.500000  9.0  8.500000  8.0
foo large  2.000000  5.0  4.500000  4.0
    small  2.333333  6.0  4.333333  2.0

In [26]:
table2 = pd.pivot_table(df, values=['D', 'E'], index=['A', 'C'], aggfunc={'D': np.mean,'E': [np.min, np.max, np.mean]})

In [27]:
table2

                  D    E
               mean amax amin      mean
A   C
bar large  5.500000  9.0  6.0  7.500000
    small  5.500000  9.0  8.0  8.500000
foo large  2.000000  5.0  4.0  4.500000
    small  2.333333  6.0  2.0  4.333333

* np.min(a) 과 min(a)

In [28]:
a = np.array([1,2,3,4])

In [29]:
np.min(a)

1

In [30]:
np.max(a)

4

In [31]:
min(a)

1

In [32]:
max(a)

4

In [33]:
np.amin(a)

1

In [34]:
np.amax(a)

4

In [35]:
np.argmin(a) # 인덱스 값을 반환?

0

In [36]:
np.argmax(a) # 인덱스 값을 반환?

3

argmin, argmax 함수들<br>
* 최소값, 최대값에 해당하는 인덱스를 리턴